# Бројеви у основи b се могу записати помоћу цифара 0, 1, …, b − 1. Ако је основа већа од 10, тада се уместо
# цифара користе слова енглеске абецеде (цифра 10 записује се са a, цифра 11 са b итд.). Напиши програм који
# исписује све троцифрене бројеве у датој основи.
#
# Улаз: Са стандардног улаза се учитава основа b (2 ≤ b ≤ 16).
#
# Излаз: На стандардни излаз исписати све троцифрене бројеве у основи b, поређане растући по вредности
# (бројеве исписати са водећим нулама).
#
# Пример
# Улаз
# 2
# Излаз
# 000
# 001
# 010
# 011
# 100
# 101
# 110
# 111

def cifra(c):
    # da bi preskocili u ASCII znakove tipa <,>,?....
    return chr(ord('0') + c) if c < 10 else chr(ord('a') + c - 10)
print(ord('a'))
b = int(input("Unesi osnovu: "))
for c2 in range(b):
    for c1 in range(b):
        for c0 in range(b):
            print(cifra(c2) + cifra(c1) + cifra(c0))
