# Напиши програм који исписује све подречи које се могу добити читањем слова дате речи кренувши од неког
# слова, у круг, назад до тог слова.
#
# Улаз: Са стандардног улаза се учитава реч састављена од малих слова, не дужа од 100 карактера.
#
# Излаз: На стандардни излаз исписати тражене цикличне пермутације те речи.
#
# Пример
# Улаз
# zdravo
# Излаз
# zdravo
# dravoz
# ravozd
# avozdr
# vozdra
# ozdrav

rec = input("Unesi rec: ")

for i in range(len(rec)):
    for j in range(i, len(rec)):
        print(rec[j], end="")
    for k in range(i):
        print(rec[k], end="")
    print()
