# Написати програм којим се за дати природан број n приказују низови бројева добијени цикличним померањем
# низа бројева 1, 2, …, n редом за 0, 1, 2, …, n − 1 места улево.
#
# Улаз: Прва линија стандардног улаза садржи природан број n ≤ 30.
#
# Излаз: Стандардни излаз садржи n линија, у којима су приказани тражени низови бројева,
# бројеви у низовима међусобно су одвојени бланко знаком.
#
# Пример
# Улаз
# 4
# Излаз
# 1 2 3 4
# 2 3 4 1
# 3 4 1 2
# 4 1 2 3

n = int(input("Unesi broj ciklicnih permutacija: "))
for i in range(1, n+1):
    for j in range(i, n+1):
        print(j, " ", sep="", end="")
    for j in range(1, i):
        print(j, " ", sep="", end="")
    print()
