# На кошаркашкој утакмици кошеви се бодују са 1, 2 или 3 поена. Потребно је одредити све комбинације
# броја кошева који су бодовани са 1 поеном, са 2 и са 3 поена ако је познат укупан број поена једног тима на
# кошаркашкој утакмици.
#
# Улаз: У првој линији стандардног улаза налази се укупан број поена на кошаркашкој утакмици (природан
# број између 40 и 150).
#
# Излаз: Свака линија стандардног излаза треба да садржи број кошева који су бодовани са 3, затим са 2 и на
# крају са 1. Комбинације треба да буду уређене лексикографски.

# Пример
# Улаз
# 6
# Излаз
# 6
# 0 0 6
# 0 1 4
# 0 2 2
# 0 3 0
# 1 0 3
# 1 1 1
# 2 0 0

poeni = int(input("Unesi broj poena na kraju kosrakaske utakmice: "))
for t in range(poeni // 3 + 1):
    for d in range(poeni // 2 + 1):
        for j in range(poeni + 1):
            if 3 * t + 2 * d + j == poeni:
                print(t, d, j)
