# У једном одељењу су одлучили да у склопу новогодишње приредбе организују мало извлачење игре лото. Да
# би повећали шансе за добитак, одлучили су да се извлаче само три куглице.
# Напиши програм који исписује које све комбинације могу бити извучене,
# ако се зна да у бубњу има n различитих куглица обележених бројевима од 1 до n.
#
# Улаз: Са стандардног улаза се уноси број n (4 ≤ n ≤ 20).
#
# Излаз: На стандардни излаз испиши све комбинације, при чему су бројеви у свакој комбинацији сортирани
# растуће, а комбинације су лексикографски сортиране.
#
# Пример
# Улаз
# 4
# Излаз
# 1 2 3
# 1 2 4
# 1 3 4
# 2 3 4

n = int(input("Unesi broj kuglica koji ucestvuje u loto izvlacenju: "))
for b1 in range(1, n+1):
    for b2 in range(b1+1, n+1):
        for b3 in range(b2+1, n+1):
            print(b1, b2, b3)
