# Напиши програм који ће исписати све подречи дате речи и то у растућем редоследу почетних позиција и
# растућем редоследу дужине. Напомена: у већини језика је слово на позицији i речи s могуће очитати изразом
# s[i].
#
# Улаз: Са стандардног улаза се учитава једна реч састављена само од малих слова енглеске абецеде.
#
# Излаз: На стандардни излаз исписати тражене подречи, сваку у посебном реду.
#
# Пример
# Улаз
# abc
# Излаз
# a
# ab
# abc
# b
# bc
# c

s = input("Unesi izabranu rec: ")
for i in range(len(s)):
    for j in range(i, len(s)):
        for k in range(i, j + 1):
            print(s[k], sep='', end='')
        print()
