# За дато n исписати све префиксе низа природних бројева који почињу са 1 и завршавају се са бројем мањим
# или једнаким од n.
#
# Улаз: Са стандардног улаза се учитава цео број n (1 ≤ n ≤ 20).
#
# Излаз: На стандардни излаз исписати све тражене префиксе, сваки у посебном реду у растућем редоследу
# дужина. Иза сваког елемента сваког префикса треба да буде исписан по један размак.
#
# Пример
# Улаз
# 3
# Излаз
# 1
# 1 2
# 1 2

n = int(input("Unesi prirodan broj do kog ide niz: "))
for i in range(1, n+1):
    for j in range(1, i+1):
        print(j, " ", end="", sep="")
    print()
