# Својевремено је постојала реклама за фирму “Југодрво” у којој се појављивала песмица
# “Југодрво-угодрвогодрво-одрво-дрво-рво-во-о” у којој су се одређивали сви суфикси дате речи.
# Слично, али мало једноставније је исписати све суфиксе низа природних бројева од 1 до n.
# Напиши програм који за дато n исписати све чланове низа
# 1, 2, 3, . . . , n, 2, 3, 4, . . . , n, 3, 4, . . . , n, . . . , n − 1, n, n.
#
# Улаз: Са стандардног улаза се учитава природан број n у границама од 1 до 30.
#
# Излаз: Бројеви се исписују на стандардни излаз, раздвојени размацима, сваки суфикс у посебном реду.
#
# Пример
# Улаз
# 4
# Излаз
# 1 2 3 4
# 2 3 4
# 3 4
# 4

n = int(input("Unesi prirodan broj do kog ide niz: "))
for i in range(1, n+1):
    for j in range(i, n+1):
        print(j, end=" ")
    print()
