# Написати програм којим се одређују дужине страница троуглова a, b, c, такве да су a, b и c природни бројеви
# за које важи да је a ≤ b ≤ c и да је обим троугла a + b + c једнак датом природном броју O.
#
# Улаз: У једној линији стандардног улаза задат је природан број O (3 ≤ O ≤ 250) који представља обим
# троугла.
#
# Излаз: У свакој линији стандардног излаза налазе се три природна броја одвојена празнином,
# који представљају могуће дужине страница троугла задатог обима. Тројке треба да буду лексикографски сортиране.
#
# Пример
# Улаз
# 7
# Излаз
# 1 3 3
# 2 2 3

obim = int(input("Unesi celobrjnu vrednost obima trougla: "))

for a in range(1,obim-3):
    for b in range (a,obim-3):
        c = obim-a-b
        if c >= a and c >= b and a+b > c :
            print (a,b,c," ", sep="")
